---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils
source: html/cd596206-abf1-f52a-e299-e18f4641741c.htm
---
# DirectContext3DDocumentUtils Methods

Returns all DirectContext3D handle instances of the given category in the document.